<template>
  <div class="main-card">
    <h1 class="h1-card">
      Задача организации в особенности же укрепление и развитие структуры
      обеспечивает шикорому кругу
    </h1>

    <div class="task-card">
      <p class="task-text">Задача организации:</p>

      <svg
        class="task-icon"
        width="16"
        height="12"
        viewBox="0 0 16 12"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M16 12H4V10H16V12ZM2 12H0V10H2V12ZM16 7H4V5H16V7ZM2 7H0V5H2V7ZM16 2H4.023V0H16V2ZM2 2H0V0H2V2Z"
          fill="#252733"
        />
      </svg>
    </div>

    <div class="text-card">
      С другой стороны реализация намеченных плановых заданий требуют
      определения и уточнения системы обучения кадров, соответствует насущным
      потребностям. Разнообразный и богатый опыт постоянное
      информационно-пропагандистское обеспечение нашей деятельности играет
      важную роль в формировании соответствующий условий активизации. Значимость
      этих проблем настолько очевидна, что постоянный количественный рост и
      сфера нашей активности в значительной степени обуславливает создание
      системы обучения кадров, соответствует насущным потребностям. Значимость
      этих проблем настолько очевидна, что консультация с широким активом в
      значительной степени обуславливает создание системы обучения кадров,
      соответствует насущным потребностям. Не следует, однако забывать, что
      консультация с широким активом требуют от нас анализа позиций, занимаемых
      участниками в отношении поставленных задач. С другой стороны реализация
      намеченных плановых заданий требуют определения и уточнения системы
      обучения кадров, соответствует насущным потребностям. Разнообразный и
      богатый опыт постоянное информационно-пропагандистское обеспечение нашей
      деятельности играет
      <p class="main-part">
        “Важную роль в формировании соответствующий условий активизации.
        Значимость этих проблем настолько очевидна”
      </p>
      Что постоянный количественный рост и сфера нашей активности в значительной
      степени обуславливает создание системы обучения кадров, соответствует
      насущным потребностям. Значимость этих проблем настолько очевидна, что
      консультация с широким активом в значительной степени обуславливает
      создание системы обучения кадров, соответствует насущным потребностям. Не
      следует, однако забывать, что консультация с широким активом требуют от
      нас анализа позиций, занимаемых участниками в отношении поставленных
      задач. С другой стороны реализация намеченных плановых заданий требуют
      определения и уточнения системы обучения кадров, соответствует насущным
      потребностям. Разнообразный и богатый опыт постоянное
      информационно-пропагандистское обеспечение нашей деятельности играет
      важную роль в формировании соответствующий условий активизации. Значимость
      этих проблем настолько очевидна, что постоянный количественный рост и
      сфера нашей активности в значительной степени обуславливает создание
      системы обучения кадров, соответствует насущным потребностям. Значимость
      этих проблем настолько очевидна, что консультация с широким активом в
      значительной степени обуславливает создание системы обучения кадров,
      соответствует насущным потребностям. Не следует, однако забывать, что
      консультация с широким активом требуют от нас анализа позиций, занимаемых
      участниками в отношении поставленных задач. С другой стороны реализация
      намеченных плановых заданий требуют определения и уточнения системы
      обучения кадров, соответствует насущным потребностям. Разнообразный и
      богатый опыт постоянное информационно-пропагандистское обеспечение нашей
      деятельности играет “Важную роль в формировании соответствующий условий
      активизации. Значимость этих проблем настолько очевидна”
    </div>
  </div>
</template>

<style scoped>
.main-card {
  flex: 843;
  height: 54em;
  overflow: scroll;
  padding: 30px 60px;
}

.h1-card {
  height: 68px;
  font-family: Inter;
  font-size: 24px;
  font-weight: 500;
  line-height: 34px;
  margin-left: 10px;
}

.task-card {
  height: 42px;
  width: 232px;
  left: 60px;
  border-radius: 10px;
  background-color: #fafafa;
  border: 1px dashed #c4c4c4;
  font-family: Inter;
  font-size: 16px;
  font-weight: 500;
  line-height: 22px;
  padding: 8px;
  display: flex;
  justify-content: space-between;
  margin-top: 15px;
}

.task-icon {
  margin-right: 6px;
  margin-top: 6px;
}

.text-card {
  font-family: Inter;
  font-size: 14px;
  font-weight: 400;
  line-height: 22px;
  margin-top: 12px;
  margin-left: 10px;
}

.main-part {
  border-radius: 10px;
  background-color: #fafafa;
  border: 1px dashed #c4c4c4;
  padding: 8px;
  font-family: Inter;
  font-size: 14px;
  font-style: italic;
  font-weight: 600;
  line-height: 22px;
  margin-top: 12px;
  margin-bottom: 12px;
  z-index: 100;
  margin-left: -10px;
}
</style>
